kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
/*
 * Metering Divisor is runtime-writable (issue #48). The stock ZBOSS
 * macro `ZB_ZCL_DECLARE_METERING_ATTRIB_LIST_EXT` declares Divisor as
 * `ZB_ZCL_ATTR_ACCESS_READ_ONLY` (zb_zcl_metering.h:2438-2445), which
 * makes Z2M's attribute-write path return NOT_AUTHORIZED at the ZCL
 * layer — no callback fires, no persistence hook runs. Hand-roll the
 * attribute list so we can flip just Divisor to READ_WRITE using
 * `ZB_ZCL_SET_ATTR_DESC_M`. All other entries reuse the stock
 * descriptors so the access flags for CurrentSummationDelivered et al
 * stay identical to what the ncs-zigbee reference builds ship.
 *
 * Multiplier stays read-only intentionally: keeping the two-variable
 * `kWh = raw × Mult ÷ Div` simple by making only one of them tunable
 * (Divisor == imp/kWh) is a deliberate scope choice — see the issue.
 */
ZB_ZCL_START_DECLARE_ATTRIB_LIST_CLUSTER_REVISION(metering_attr_list,
						  ZB_ZCL_METERING)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID,
			     &dev_ctx.metering_current_summation)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_STATUS_ID,
			     &dev_ctx.metering_status)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_UNIT_OF_MEASURE_ID,
			     &dev_ctx.metering_unit_of_measure)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_SUMMATION_FORMATTING_ID,
			     &dev_ctx.metering_summation_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_METERING_DEVICE_TYPE_ID,
			     &dev_ctx.metering_device_type)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_INSTANTANEOUS_DEMAND_ID,
			     &dev_ctx.metering_instantaneous_demand)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_DEMAND_FORMATTING_ID,
			     &dev_ctx.metering_demand_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_HISTORICAL_CONSUMPTION_FORMATTING_ID,
			     &dev_ctx.metering_historical_consumption_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_MULTIPLIER_ID,
			     &dev_ctx.metering_multiplier)
	ZB_ZCL_SET_ATTR_DESC_M(ZB_ZCL_ATTR_METERING_DIVISOR_ID,
			       &dev_ctx.metering_divisor,
			       ZB_ZCL_ATTR_TYPE_U24,
			       ZB_ZCL_ATTR_ACCESS_READ_WRITE)
	/*
	 * Manufacturer-specific min-pulse-width filter threshold (issue
	 * #59 impl-2). Kept in the Metering cluster's attribute list so
	 * the external converter can address it against the same cluster
	 * as the Divisor override — one converter, two knobs. The
	 * manuf_code (Nordic 0x1015) segregates it from any future
	 * Metering-cluster attribute ID collision.
	 */
	ZB_ZCL_SET_MANUF_SPEC_ATTR_DESC(
		ZB_ZCL_ATTR_METERING_MIN_PULSE_WIDTH_US_ID,
		ZB_ZCL_ATTR_TYPE_U16,
		ZB_ZCL_ATTR_ACCESS_READ_WRITE,
		ZB_ZCL_MIN_PULSE_WIDTH_MANUF_CODE,
		&dev_ctx.metering_min_pulse_width_us)
ZB_ZCL_FINISH_DECLARE_ATTRIB_LIST;

/*
 * Poll Control server (#62 option B). Declaring this cluster is what
 * flips zigbee-herdsman from "fail the write after 10 s" to "queue the
 * write and flush it on the device's next check-in" — herdsman defaults
 * a genPollCtrl device's pendingRequestTimeout to one check-in interval
 * (1 day if it hasn't read ours yet), then answers our Check-In with
 * startFastPolling=1 whenever it has something pending for us.
 *
 * ZBOSS starts the check-in process on its own during ZCL periodic-
 * activity init when a Poll Control SERVER cluster is present, so there
 * is no explicit zb_zcl_poll_control_start() call here.
 *
 * The macro also declares a hidden `srv_cfg_data_ctx_<name>` holding the
 * bound client's addr/endpoint (ADDR_DATA attribute) — that's why the
 * attribute list is declared here rather than being hand-rolled.
 */
ZB_ZCL_DECLARE_POLL_CONTROL_ATTRIB_LIST(
	poll_control_attr_list,
	&dev_ctx.poll_checkin_interval,
	&dev_ctx.poll_long_poll_interval,
	&dev_ctx.poll_short_poll_interval,
	&dev_ctx.poll_fast_poll_timeout,
	&dev_ctx.poll_checkin_interval_min,
	&dev_ctx.poll_long_poll_interval_min,
	&dev_ctx.poll_fast_poll_timeout_max);

ZB_DECLARE_METER_CLUSTER_LIST(
	app_clusters,
	basic_attr_list,
	identify_attr_list,
	metering_attr_list,
	poll_control_attr_list);

ZB_DECLARE_METER_EP(
	app_ep,
	APP_ENDPOINT,
	app_clusters);

ZBOSS_DECLARE_DEVICE_CTX_1_EP(
	app_ctx,
	app_ep);

static bool joined;
static bool endpoint_registered;

/*
 * The current effective Divisor (imp/kWh), kept in sync with the
 * ZCL attribute table. Two roles:
 *   - Compare-against-previous when a Z2M attribute write arrives, so
 *     a rejected out-of-range write can be rolled back without
 *     re-parsing the packed u24 attribute value.
 *   - Debug logging so a "why is Z2M reading 0.5 kWh instead of 1?"
 *     can be answered from the console.
 * Populated from NVS (or CONFIG_APP_METERING_DEFAULT_IMP_PER_KWH on
 * cold boot) inside metering_attrs_init(), then updated by the ZCL
 * device callback on every accepted Divisor write.
 */
static uint32_t effective_divisor;

/* Set by zigbee_app_start_join() (Zephyr thread context) and cleared by
 * the ZBOSS signal handler on ZB_BDB_SIGNAL_STEERING (ZBOSS thread
 * context) — an atomic keeps the two-thread hand-off honest. Only
 * user-initiated joins get LED feedback; stack-internal auto-rejoin
 * after ZB_ZDO_SIGNAL_LEAVE stays silent so a coordinator restart
 * in the middle of the night doesn't blink a mounted meter.
 */
static atomic_t user_join_in_flight = ATOMIC_INIT(0);

/*
 * After a successful join (steering) or a successful re-attach
 * (device_reboot), set the steady-state long-poll interval and start
 * turbo poll for the Z2M interview window. Turbo poll runs at ~100 ms
 * cadence for its timeout and auto-reverts to the long-poll interval
 * on expiry — no separate leave callback required.
 *
 * ZBOSS API note: zb_zdo_pim_set_long_poll_interval is only valid
 * AFTER join; during steering the interval snaps back to the default
 * (5 s). That's why this runs from the signal handler, not init.
 */
static void apply_sleepy_poll_intervals_if_joined(zb_ret_t status)
{
	if (!IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED) || status != RET_OK) {
		return;
	}

	/*
	 * Push the Poll Control attributes into the PIM.
	 *
	 * ncs-zigbee's docs/known_issues.rst (KRKNWK, "Apply Poll Control
	 * values loaded from NVRAM to the PIM") documents that ZBOSS does
	 * NOT do this itself: the attribute values survive a reboot in
	 * NVRAM, but nothing pushes them at the Poll Interval Manager, so
	 * without this the device silently reverts to the ZBOSS default
	 * 5 s long poll after a re-attach. The workaround in that doc is
	 * exactly this block, hoisted here so it covers both the fresh-join
	 * (STEERING) and re-attach (DEVICE_REBOOT) call sites.
	 *
	 * Reading back through the attribute table rather than using the
	 * Kconfig values directly is the point — if a coordinator has
	 * written LongPollInterval, the table holds its value and the PIM
	 * must follow it.
	 */
	zb_zcl_attr_t *attr_desc;
	zb_uint32_t long_poll_qs = 0;

