kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
		/* Only paint the outcome if a user-initiated join was in
		 * flight — auto-rejoin after ZB_ZDO_SIGNAL_LEAVE fires
		 * the same signal and must stay silent (issue #29).
		 */
		if (atomic_cas(&user_join_in_flight, 1, 0)) {
			led_cancel(LED_PATTERN_JOINING);
			if (status == RET_OK) {
				led_request(LED_PATTERN_JOIN_SUCCESS,
					    LED_PRIO_JOIN_SUCCESS);
			} else {
				led_request(LED_PATTERN_JOIN_FAIL,
					    LED_PRIO_JOIN_FAIL);
			}
		}
		apply_sleepy_poll_intervals_if_joined(status);
		break;

	case ZB_BDB_SIGNAL_DEVICE_REBOOT:
		/* Reboot that re-attached to the saved network in NVRAM (no
		 * fresh steering). Sleepy poll intervals aren't persisted, so
		 * re-apply them here. No LED — there was no user-initiated
		 * join event on this path.
		 */
		if (status == RET_OK) {
			LOG_INF("device reboot: reattached to saved network");
			joined = true;
			rx_idle_probe_kick("post-reboot-reattach");
		}
		apply_sleepy_poll_intervals_if_joined(status);
		break;

	case ZB_ZDO_SIGNAL_LEAVE:
		LOG_WRN("left network");
		joined = false;
		break;

	default:
		break;
	}

	ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
	if (bufid) {
		zb_buf_free(bufid);
	}
}

/* ZCL expresses every Poll Control interval in quarter-seconds. */
#define QS_FROM_SEC(s)  ((zb_uint32_t)(s) * 4U)
#define QS_FROM_MS(ms)  ((zb_uint32_t)(ms) / 250U)

/*
 * Seed the Poll Control attributes from the app's Kconfig (#62 option B).
 *
 * These become the single source of truth for poll cadence. Before this
 * cluster existed, apply_sleepy_poll_intervals_if_joined() pushed the
 * Kconfig values straight at the PIM; now the attribute table holds them
 * and the PIM is driven *from* the attributes, so a coordinator that
 * writes LongPollInterval actually changes behaviour instead of being
 * silently overwritten on the next join. That was the conflict flagged as
 * a risk on the ticket.
 */
static void poll_control_attrs_init(void)
{
	dev_ctx.poll_checkin_interval =
		QS_FROM_SEC(CONFIG_APP_ZIGBEE_CHECKIN_INTERVAL_S);
	dev_ctx.poll_long_poll_interval =
		QS_FROM_MS(CONFIG_APP_ZIGBEE_LONG_POLL_INTERVAL_MS);
	dev_ctx.poll_fast_poll_timeout =
		(zb_uint16_t)QS_FROM_SEC(CONFIG_APP_ZIGBEE_FAST_POLL_TIMEOUT_S);

	/* Short poll is the cadence used *during* a fast-poll window. The
	 * ZCL default (2 qs = 500 ms) is slower than the 100 ms turbo poll
	 * the button path uses, but it only runs for fast_poll_timeout and
	 * herdsman needs just a few round-trips to drain its queue.
	 */
	dev_ctx.poll_short_poll_interval =
		ZB_ZCL_POLL_CONTROL_SHORT_POLL_INTERVAL_DEFAULT_VALUE;

	/* 0 = "no client-imposed floor/ceiling". We deliberately don't
	 * restrict what a coordinator may write; if Z2M wants to check in
	 * more often it's welcome to, and the battery cost is its own
	 * (see the Kconfig help).
	 */
	dev_ctx.poll_checkin_interval_min =
		ZB_ZCL_POLL_CONTROL_CHECKIN_MIN_INTERVAL_DEFAULT_VALUE;
	dev_ctx.poll_long_poll_interval_min =
		ZB_ZCL_POLL_CONTROL_LONG_POLL_MIN_INTERVAL_DEFAULT_VALUE;
	dev_ctx.poll_fast_poll_timeout_max =
		ZB_ZCL_POLL_CONTROL_FAST_POLL_MAX_TIMEOUT_DEFAULT_VALUE;

	LOG_INF("poll control: checkin=%u s, fast_poll_timeout=%u s, long_poll=%u ms",
		CONFIG_APP_ZIGBEE_CHECKIN_INTERVAL_S,
		CONFIG_APP_ZIGBEE_FAST_POLL_TIMEOUT_S,
		CONFIG_APP_ZIGBEE_LONG_POLL_INTERVAL_MS);
}

static void metering_attrs_init(void)
{
	/* CurrentSummationDelivered — starts at 0; replaced by whatever
	 * NVS persisted before we finish booting, then live-updated as
	 * pulses come in.
	 */
	ZB_ASSIGN_UINT48(dev_ctx.metering_current_summation, 0, 0);

	dev_ctx.metering_status = 0;                 /* no fault flags */
	dev_ctx.metering_unit_of_measure = METERING_UNIT_KWH;
	dev_ctx.metering_summation_formatting = METERING_SUMM_FORMATTING;
	dev_ctx.metering_device_type = METERING_DEVICE_TYPE;

	/* Instantaneous demand — the design doc doesn't publish a live
	 * W/kW figure (HA derives it via the derivative helper). Leave
	 * zero. Demand/historical formatting fields are ignored by Z2M
	 * when the demand attribute isn't reporting, so 0 is safe.
	 * ZB_INT24_FROM_INT32 clamps in-place and needs an l-value.
	 */
	{
		zb_int32_t demand_init = 0;

		ZB_INT24_FROM_INT32(dev_ctx.metering_instantaneous_demand,
				    demand_init);
	}
	dev_ctx.metering_demand_formatting = 0;
	dev_ctx.metering_historical_consumption_formatting = 0;

	/* Multiplier / Divisor. Both are u24 in the wire representation
	 * (packed structs on nRF, low+high halves). Use the ZBOSS
	 * helper that converts a u32 into the packed u24 — writing the
	 * halves by hand is easy to get wrong and the helper is free.
	 *
	 * Multiplier is pinned to 1 (design-doc default; the only tuning
	 * knob is Divisor).
	 *
	 * Divisor comes from NVS if a Z2M write has previously been
	 * persisted; otherwise falls back to the compile-time default.
	 * A value in NVS that has fallen out of range (e.g., a firmware
	 * that used to accept a wider range wrote something we now
	 * reject) is treated the same as no value — surface the fallback
	 * via a warning so the installer notices, but don't refuse to
	 * boot.
	 */
	zb_uint32_to_uint24(METERING_MULTIPLIER, &dev_ctx.metering_multiplier);

	uint32_t divisor = METERING_DEFAULT_DIVISOR;
	uint32_t nvs_val = 0;
	int rc = nvs_store_load_imp_per_kwh(&nvs_val);

	if (rc == 0) {
		if (calibration_is_valid_imp_per_kwh(nvs_val)) {
			divisor = nvs_val;
			LOG_INF("Metering Divisor: imp/kWh=%u (from NVS)",
				(unsigned)divisor);
		} else {
			LOG_WRN("NVS imp/kWh=%u out of range [%u..%u] — "
				"using compile-time default %u",
				(unsigned)nvs_val,
				CALIBRATION_IMP_PER_KWH_MIN,
				CALIBRATION_IMP_PER_KWH_MAX,
				(unsigned)divisor);
		}
	} else if (rc == -ENOENT) {
		LOG_INF("Metering Divisor: imp/kWh=%u (compile-time default; "
			"nothing persisted yet)",
			(unsigned)divisor);
	} else {
		LOG_ERR("nvs_store_load_imp_per_kwh failed: %d — using default %u",
			rc, (unsigned)divisor);
	}

	effective_divisor = divisor;
	zb_uint32_to_uint24(divisor, &dev_ctx.metering_divisor);

