kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
	/*
	 * Manufacturer-specific min-pulse-width filter threshold (#59
	 * impl-2). The active TIMER3.CC[0] value was already programmed
	 * by hw_pulse_counter_init() from the same NVS slot; we just
	 * need to mirror it into the ZCL attribute so a Z2M read reflects
	 * the running value. Do the load again (cheap) so this table
	 * stays authoritative even if the load order swaps in future.
	 */
	uint32_t min_width_us = CONFIG_APP_PULSE_MIN_WIDTH_US;
	uint32_t nvs_width = 0;
	int rc_width = nvs_store_load_pulse_min_width_us(&nvs_width);

	if (rc_width == 0 &&
	    calibration_is_valid_pulse_min_width_us(nvs_width)) {
		min_width_us = nvs_width;
	}
	dev_ctx.metering_min_pulse_width_us = (zb_uint16_t)min_width_us;
}

static void app_clusters_attr_init(void)
{
	/* Basic cluster (0x0000). ZCL_VERSION populated from header;
	 * power source declared as battery — a sleepy ED on AAA
	 * signals its polling model that way, which changes Z2M's
	 * expected report cadence (poll- rather than push-heavy).
	 * Bench-USB power is still declared as battery because that's
	 * the target power model.
	 */
	dev_ctx.basic_attr.zcl_version = ZB_ZCL_VERSION;
	dev_ctx.basic_attr.app_version = BASIC_APP_VERSION;
	dev_ctx.basic_attr.stack_version = BASIC_STACK_VERSION;
	dev_ctx.basic_attr.hw_version = BASIC_HW_VERSION;
	dev_ctx.basic_attr.power_source = ZB_ZCL_BASIC_POWER_SOURCE_BATTERY;
	dev_ctx.basic_attr.ph_env = ZB_ZCL_BASIC_ENV_UNSPECIFIED;

	/* ZCL strings are length-prefixed (Pascal-style): first byte is
	 * the length excluding the terminator. `ZB_ZCL_SET_STRING_VAL`
	 * writes both the prefix and the payload; `ZB_ZCL_STRING_CONST_SIZE`
	 * is the compile-time strlen minus trailing NUL.
	 */
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.mf_name,
			      BASIC_MANUF_NAME,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_MANUF_NAME));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.model_id,
			      BASIC_MODEL_ID,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_MODEL_ID));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.date_code,
			      BASIC_DATE_CODE,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_DATE_CODE));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.location_id,
			      BASIC_LOCATION_DESC,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_LOCATION_DESC));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.sw_ver,
			      BASIC_SW_BUILD_ID,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_SW_BUILD_ID));

	/* Identify cluster (0x0003). Default identify time = 0 =
	 * device is NOT currently identifying.
	 */
	dev_ctx.identify_attr.identify_time =
		ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

	metering_attrs_init();
	poll_control_attrs_init();
}

/*
 * ZCL device callback — invoked by ZBOSS post-write, after the
 * incoming attribute value has already been written into
 * `dev_ctx.metering_divisor`. If we reject, ZBOSS uses `p->status`
 * as the ZCL response; the attribute-table update is our problem to
 * undo (see the rollback path below).
 *
 * Scope: this handler is a filter for one attribute (Metering.Divisor)
 * and quietly RET_OK's every other invocation so cluster machinery
 * that ZBOSS drives through the same callback (identify effects, etc.)
 * still works. Other paths that want to hook this callback in future
 * should extend the switch here rather than replacing it.
 */
static void zcl_device_cb(zb_bufid_t bufid)
{
	zb_zcl_device_callback_param_t *p =
		ZB_BUF_GET_PARAM(bufid, zb_zcl_device_callback_param_t);

	p->status = RET_OK;

	if (p->device_cb_id != ZB_ZCL_SET_ATTR_VALUE_CB_ID) {
		return;
	}
	if (p->cb_param.set_attr_value_param.cluster_id !=
	    ZB_ZCL_CLUSTER_ID_METERING) {
		return;
	}

	uint16_t attr_id = p->cb_param.set_attr_value_param.attr_id;

	if (attr_id == ZB_ZCL_ATTR_METERING_MIN_PULSE_WIDTH_US_ID) {
		uint16_t new_width =
			p->cb_param.set_attr_value_param.values.data16;

		if (!calibration_is_valid_pulse_min_width_us(new_width)) {
			LOG_WRN("rejecting min-pulse-width write: %u out of "
				"range [%u..%u] — rolling back to %u",
				(unsigned)new_width,
				CALIBRATION_PULSE_MIN_WIDTH_US_MIN,
				CALIBRATION_PULSE_MIN_WIDTH_US_MAX,
				(unsigned)dev_ctx.metering_min_pulse_width_us);

			uint16_t rollback = dev_ctx.metering_min_pulse_width_us;

			ZB_ZCL_SET_ATTRIBUTE(APP_ENDPOINT,
					     ZB_ZCL_CLUSTER_ID_METERING,
					     ZB_ZCL_CLUSTER_SERVER_ROLE,
					     ZB_ZCL_ATTR_METERING_MIN_PULSE_WIDTH_US_ID,
					     (zb_uint8_t *)&rollback,
					     ZB_FALSE);
			p->status = RET_OUT_OF_RANGE;
			return;
		}

		/* Push to hardware first — even if NVS persistence fails,
		 * the running filter tracks the accepted value until the
		 * next reboot (which will revert to the last persisted or
		 * compile-time default). Same in-memory-only fallback as
		 * the Divisor path below.
		 */
		hw_pulse_counter_set_min_width_us(new_width);

		int rc = nvs_store_save_pulse_min_width_us(new_width);

		if (rc) {
			LOG_ERR("nvs_store_save_pulse_min_width_us(%u) "
				"failed: %d — value applied in memory only",
				(unsigned)new_width, rc);
		} else {
			LOG_INF("min-pulse-width updated: %u µs (persisted)",
				(unsigned)new_width);
		}

		dev_ctx.metering_min_pulse_width_us = new_width;
		return;
	}

	if (attr_id != ZB_ZCL_ATTR_METERING_DIVISOR_ID) {
		return;
	}

	/* zb_uint24_t on the target is a packed {u16 low, u8 high}
	 * struct (zb_types.h:1011). Rebuild the u32 by hand — the
	 * ZBOSS helper only goes the other way (u32→u24).
	 */
	zb_uint24_t v24 = p->cb_param.set_attr_value_param.values.data24;
	uint32_t new_divisor = ((uint32_t)v24.high << 16) | v24.low;

	if (!calibration_is_valid_imp_per_kwh(new_divisor)) {
		LOG_WRN("rejecting Metering Divisor write: %u out of range "
			"[%u..%u] — rolling back to %u",
			(unsigned)new_divisor,
			CALIBRATION_IMP_PER_KWH_MIN,
			CALIBRATION_IMP_PER_KWH_MAX,
			(unsigned)effective_divisor);

		/* ZBOSS already committed the bad value to the attribute
		 * store; put the previously-effective value back so a
		 * follow-up Z2M read returns the still-valid Divisor.
		 * ZB_FALSE bypasses the access-flag check (we're the app,
		 * we own this attribute).
		 */
		zb_uint24_t rollback;

