kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
		zb_uint32_to_uint24(effective_divisor, &rollback);
		ZB_ZCL_SET_ATTRIBUTE(APP_ENDPOINT,
				     ZB_ZCL_CLUSTER_ID_METERING,
				     ZB_ZCL_CLUSTER_SERVER_ROLE,
				     ZB_ZCL_ATTR_METERING_DIVISOR_ID,
				     (zb_uint8_t *)&rollback,
				     ZB_FALSE);
		p->status = RET_OUT_OF_RANGE;
		return;
	}

	int rc = nvs_store_save_imp_per_kwh(new_divisor);

	if (rc) {
		/* Persist failed — keep the write in memory anyway. Losing
		 * the value on next reboot is a worse outcome than
		 * refusing a valid write; the installer will notice next
		 * boot when the value snaps back to the compile-time
		 * default.
		 */
		LOG_ERR("nvs_store_save_imp_per_kwh(%u) failed: %d — "
			"value applied in memory only",
			(unsigned)new_divisor, rc);
	} else {
		LOG_INF("Metering Divisor updated: imp/kWh=%u (persisted)",
			(unsigned)new_divisor);
	}

	effective_divisor = new_divisor;
}

int zigbee_app_init(void)
{
	/* Register the endpoint context BEFORE zigbee_enable(). Without
	 * this, ZBOSS has no clusters to advertise during commissioning
	 * and bdb_start_top_level_commissioning() asserts — see #4's
	 * notes for the exact failure signature.
	 */
	ZB_ZCL_REGISTER_DEVICE_CB(zcl_device_cb);
	ZB_AF_REGISTER_DEVICE_CTX(&app_ctx);
	app_clusters_attr_init();
	endpoint_registered = true;

	/*
	 * Sleepy-ED behaviour (issue #8 blocker 1).
	 *
	 * CONFIG_ZIGBEE_ROLE_END_DEVICE fixes the MAC-layer role;
	 * zb_set_rx_on_when_idle() (called via zigbee_configure_sleepy_behavior)
	 * is the runtime flag that actually gates whether the radio sleeps
	 * between parent polls. rx-on-when-idle=TRUE burns ~5 mA average —
	 * a non-starter for the AAA target — so we default to sleepy=true
	 * and cover Z2M's interview deadline with a turbo-poll window
	 * (see zboss_signal_handler for ZB_BDB_SIGNAL_STEERING).
	 *
	 * dev.conf can flip APP_ZIGBEE_SLEEPY_ED=n as an escape hatch if the
	 * turbo-poll window ever fails to cover a slow Z2M read — that path
	 * is what the previous USB-dev build used unconditionally.
	 *
	 * ed_timeout / keepalive_timeout come from the R23 light_switch
	 * reference sample (samples/light_switch/src/main.c:837-838). Without
	 * a large aging timeout, the parent evicts a sleepy child before the
	 * next long-poll cycle — the practical failure mode is a device that
	 * joins once, drops off after ~7.5 s (ZB_TIME_ED_IDLE default), and
	 * never rejoins because it never wakes.
	 */
	if (IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED)) {
		zb_set_ed_timeout(ED_AGING_TIMEOUT_64MIN);
		zb_set_keepalive_timeout(
			ZB_MILLISECONDS_TO_BEACON_INTERVAL(30000));
	}
	zigbee_configure_sleepy_behavior(IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED));
	rx_idle_probe_kick("post-configure-sleepy");

	zigbee_enable();
	return 0;
}

/* Callbacks that talk to ZBOSS API must run on the ZBOSS thread — see
 * the equivalent comment in the join/reset flow.
 */
static void start_steering_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	LOG_INF("ZBOSS thread: invoking bdb_start_top_level_commissioning");
	zb_bool_t rc = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);

	LOG_INF("ZBOSS thread: bdb_start returned %s",
		rc == ZB_TRUE ? "TRUE (scheduled)" : "FALSE (rejected)");
}

static void factory_reset_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	LOG_WRN("ZBOSS thread: invoking zb_bdb_reset_via_local_action");
	joined = false;
	zb_bdb_reset_via_local_action(0);
}

/*
 * Short-press wake (#62). Restarting turbo poll on an already-joined
 * device only changes the poll cadence — join state, bindings and the
 * attribute table are all untouched, which is what the acceptance
 * criteria require. ZBOSS reverts to the long-poll interval when the
 * window expires, so there's nothing to tear down afterwards.
 */
static void wake_turbo_poll_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	zb_zdo_pim_start_turbo_poll_continuous(
		CONFIG_APP_ZIGBEE_WAKE_TURBO_POLL_MS);
	LOG_INF("ZBOSS thread: wake turbo-poll window open for %d ms",
		CONFIG_APP_ZIGBEE_WAKE_TURBO_POLL_MS);
}

/*
 * Trampoline that runs on the ZBOSS thread and does the actual
 * `ZB_ZCL_SET_ATTRIBUTE` call. The publish API packs the pulse total
 * into a scheduler-callback-sized u8 index via a shadow variable —
 * `param` is only 8 bits so we can't pass the 48-bit summation
 * through it directly.
 */
static uint64_t pending_summation_total;

static void write_summation_attribute(uint64_t pulse_total)
{
	struct metering_u48 v = metering_scale_to_u48(pulse_total);
	zb_uint48_t summation;

	ZB_ASSIGN_UINT48(summation, v.high, v.low);

	/* Persist into the attribute table AND mark for reporting.
	 * `ZB_FALSE` on check_access means the write skips the ZCL
	 * read-only access check — required because the summation
	 * attribute is declared read-only (external writers must go
	 * through the ZCL API, but on-device app code goes direct).
	 */
	ZB_ZCL_SET_ATTRIBUTE(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_METERING,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID,
		(zb_uint8_t *)&summation,
		ZB_FALSE);
}

/*
 * Explicit ZCL Report Attributes frame for CurrentSummationDelivered.
 * Runs on the ZBOSS thread. Bypasses the reporting engine's delta gate
 * — see the zigbee_app.h comment on publish_summation_and_report for
 * the rationale (issue #20).
 *
 * Two failure modes we intentionally log but recover from:
 *   * No reporting slot for the attribute yet — coordinator hasn't
 *     sent ConfigureReporting since our last join, or we booted before
 *     Z2M finished interviewing. Frame can't be built without a
 *     destination; skip and let the reporting engine try again next
 *     tick.
 *   * No free OUT buffer. ZBOSS's buffer pool is small; a report on
 *     top of an already-pending report can transiently starve. Skip
 *     and rely on the next tick.
 */
static void send_explicit_summation_report(void)
{
	zb_zcl_reporting_info_t *rep_info = zb_zcl_find_reporting_info(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_METERING,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID);

	if (rep_info == NULL) {
		LOG_WRN("no reporting slot for CurrentSummationDelivered — "
			"coordinator ConfigureReporting not seen yet");
		return;
	}

	LOG_INF("reporting slot: min_interval=%us max_interval=%us "
		"reportable_change=0x%04x%08x",
		rep_info->u.send_info.min_interval,
		rep_info->u.send_info.max_interval,
		rep_info->u.send_info.delta.u48.high,
		rep_info->u.send_info.delta.u48.low);

