kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
	zb_bufid_t bufid = zb_buf_get_out();

	if (bufid == 0) {
		LOG_WRN("no free OUT buffer for explicit summation report");
		return;
	}

	zb_zcl_send_report_attr_command(rep_info, bufid);
}

static void publish_summation_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);

	write_summation_attribute(pending_summation_total);
}

static void publish_summation_and_report_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);

	write_summation_attribute(pending_summation_total);
	send_explicit_summation_report();
}

void zigbee_app_start_join(void)
{
	LOG_INF("starting network steering");
	/* Mark this steering as user-initiated so the signal handler
	 * paints the outcome (see zboss_signal_handler). The blue-blink
	 * request goes in here so the LED shows intent immediately —
	 * a stack-internal steering that hasn't been requested by the
	 * app never sets this flag and never asks for the LED.
	 */
	atomic_set(&user_join_in_flight, 1);
	led_request(LED_PATTERN_JOINING, LED_PRIO_JOINING);
	ZB_SCHEDULE_APP_CALLBACK(start_steering_cb, 0);
}

void zigbee_app_factory_reset(void)
{
	LOG_WRN("factory reset — leaving network and erasing NVS");
	ZB_SCHEDULE_APP_CALLBACK(factory_reset_cb, 0);
}

bool zigbee_app_is_joined(void)
{
	return joined;
}

void zigbee_app_wake_for_write(void)
{
	if (!IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED)) {
		/* Radio is already always-on; downlinks arrive immediately
		 * and there is no poll cadence to shorten.
		 */
		LOG_INF("wake request ignored — not a sleepy ED");
		return;
	}
	if (!joined) {
		/* zb_zdo_pim_* addresses the parent, and without an
		 * association there isn't one. The button dispatch routes
		 * this case to JOIN instead, so reaching here means the
		 * device dropped its parent between classify and dispatch.
		 */
		LOG_WRN("wake request ignored — not joined");
		return;
	}

	LOG_INF("wake for write: requesting %d ms turbo-poll window",
		CONFIG_APP_ZIGBEE_WAKE_TURBO_POLL_MS);
	ZB_SCHEDULE_APP_CALLBACK(wake_turbo_poll_cb, 0);
}

void zigbee_app_publish_summation(uint64_t pulse_total)
{
	if (!endpoint_registered) {
		/* zigbee_app_init() failed or hasn't run yet — nothing
		 * to publish into. Silent no-op keeps main.c's sample
		 * loop from having to gate its call site on Zigbee
		 * bring-up state.
		 */
		return;
	}

	/* Hand off to the ZBOSS thread. `pending_summation_total` is
	 * a single-writer/single-reader shadow, and back-to-back calls
	 * will collapse into whichever value the ZBOSS thread reads
	 * last — that's actually the behaviour we want (report the
	 * freshest total, not a queue of stale ones).
	 */
	pending_summation_total = pulse_total;
	ZB_SCHEDULE_APP_CALLBACK(publish_summation_cb, 0);
}

void zigbee_app_publish_summation_and_report(uint64_t pulse_total)
{
	if (!endpoint_registered) {
		return;
	}

	pending_summation_total = pulse_total;
	ZB_SCHEDULE_APP_CALLBACK(publish_summation_and_report_cb, 0);
}
